{
  "secret_study_3d_assets": {
    "architectural_elements": [
      {
        "name": "Hidden Bookshelf Door",
        "description": "A bookshelf that swings open to reveal the secret study, triggered by a hidden lever or book."
      },
      {
        "name": "Wooden Paneling",
        "description": "Dark, ornate wooden panels lining the walls, some with hidden compartments or carvings."
      },
      {
        "name": "High Ceiling with Moldings",
        "description": "Decorative ceiling moldings with cracks, peeling gold leaf, and cobwebs."
      },
      {
        "name": "Small Stained-Glass Window",
        "description": "A single, dimly lit stained-glass window with eerie or occult symbols."
      },
      {
        "name": "Stone or Wooden Floor",
        "description": "A mix of stone tiles and wooden planks, with mysterious stains, scratches, or symbols etched into the surface."
      }
    ],
    "furniture_and_decor": [
      {
        "name": "Antique Desk",
        "description": "A large, ornate desk with drawers, ink stains, and a leather writing surface. Some drawers may be locked."
      },
      {
        "name": "Leather Armchair",
        "description": "A worn, high-backed armchair with cracks in the leather, positioned near the desk."
      },
      {
        "name": "Bookshelves",
        "description": "Floor-to-ceiling shelves filled with ancient, leather-bound books, some chained or marked with occult symbols."
      },
      {
        "name": "Globe",
        "description": "An antique globe, possibly spinning on its own or marked with strange locations."
      },
      {
        "name": "Candelabras",
        "description": "Iron or brass candelabras with flickering candles, casting eerie shadows."
      }
    ],
    "atmospheric_details": [
      {
        "name": "Cobwebs",
        "description": "Thick cobwebs draped across the bookshelves, desk, and ceiling corners."
      },
      {
        "name": "Dust Particles",
        "description": "Floating in the air, visible in the dim candlelight."
      },
      {
        "name": "Flickering Lights",
        "description": "Candles or lanterns casting uneven, flickering light, creating long, shifting shadows."
      },
      {
        "name": "Ghostly Whispers",
        "description": "Faint whispers, the sound of pages turning, or distant murmurs from unseen figures."
      },
      {
        "name": "Cold Spots",
        "description": "Sudden chills near the desk or bookshelves, with visible breath in the air."
      }
    ],
    "interactive_objects": [
      {
        "name": "Ancient Tome",
        "description": "A large, chained book on the desk or shelf, filled with forbidden knowledge or puzzles."
      },
      {
        "name": "Rusty Key",
        "description": "A key hidden in a desk drawer, inside a book, or behind a loose panel."
      },
      {
        "name": "Parchment or Letter",
        "description": "A yellowed parchment or letter on the desk, containing clues or cryptic messages."
      },
      {
        "name": "Occult Artifacts",
        "description": "Strange objects like a crystal ball, tarot cards, or a pentagram necklace hidden in drawers or on shelves."
      },
      {
        "name": "Hidden Compartment",
        "description": "A secret drawer in the desk or a loose panel in the wall, containing a map, key, or artifact."
      }
    ],
    "environmental_effects": [
      {
        "name": "Drafts",
        "description": "Papers or curtains moving as if pushed by an unseen force."
      },
      {
        "name": "Fog",
        "description": "A thin layer of mist near the floor, especially around the desk or bookshelves."
      },
      {
        "name": "Bloodstains or Ink Blots",
        "description": "Mysterious stains on the desk, floor, or parchment, hinting at past rituals or violence."
      },
      {
        "name": "Falling Ash",
        "description": "Ash or dust drifting down from the ceiling or shelves, especially when disturbed."
      }
    ],
    "lighting": [
      {
        "name": "Candlelight",
        "description": "Flickering candles on the desk or candelabras, casting eerie, dancing shadows."
      },
      {
        "name": "Moonlight",
        "description": "Faint moonlight filtering through the stained-glass window, casting colored shadows."
      },
      {
        "name": "Ghostly Glow",
        "description": "A faint, eerie glow emanating from occult artifacts or certain books."
      }
    ]
  }
}
