[
	{
		"category": "History",
		"description": "The mansion was built in 1789 by Elias Blackwood, a wealthy and ruthless industrialist."
	},
	{
		"category": "History",
		"description": "Elias’s first wife, Isolde, vanished during a grand ball in 1795, leaving behind only a trail of bloodstains on the dance floor."
	},
	{
		"category": "History",
		"description": "Elias remarried Lilith, a woman rumored to practice dark magic, in 1802."
	},
	{
		"category": "History",
		"description": "Elias died in 1810 under mysterious circumstances, found clutching a locket with a portrait of an unknown woman."
	},
	{
		"category": "History",
		"description": "The mansion passed to Elias’s son, Victor Blackwood, who was known for his cruelty and obsession with the occult."
	},
	{
		"category": "History",
		"description": "Victor’s daughter, Elara, drowned in the mansion’s fountain in 1837. Witnesses claimed she was pulled under by invisible hands."
	},
	{
		"category": "History",
		"description": "The mansion was abandoned in 1850 after Victor’s death, as locals believed it was cursed."
	},
	{
		"category": "History",
		"description": "A fire in 1872 destroyed the west wing, killing three firefighters. The cause was never determined."
	},
	{
		"category": "History",
		"description": "In 1899, the mansion was bought by Dr. Alistair Graves, a scientist who conducted secret experiments on the paranormal."
	},
	{
		"category": "History",
		"description": "Dr. Graves disappeared in 1905, leaving behind journals filled with sketches of monstrous creatures and frantic notes."
	},
	{
		"category": "Mysterious Events",
		"description": "The grand staircase sometimes leads to a hallway that doesn’t exist, vanishing when followed."
	},
	{
		"category": "Mysterious Events",
		"description": "Whispers echo through the walls, especially in the master bedroom, even when no one is there."
	},
	{
		"category": "Mysterious Events",
		"description": "A portrait of Isolde Blackwood occasionally 'bleeds' from the eyes, staining the floor below."
	},
	{
		"category": "Mysterious Events",
		"description": "A piano in the ballroom plays by itself at midnight, always the same haunting melody."
	},
	{
		"category": "Mysterious Events",
		"description": "Dark, humanoid shadows move through the corridors, disappearing when approached."
	},
	{
		"category": "Mysterious Events",
		"description": "Certain rooms become freezing cold for no reason, even in the middle of summer."
	},
	{
		"category": "Mysterious Events",
		"description": "Furniture rearranges itself overnight, sometimes forming strange, occult symbols."
	},
	{
		"category": "Mysterious Events",
		"description": "Blood-curdling screams are heard from the cellar, but no one is ever found there."
	},
	{
		"category": "Mysterious Events",
		"description": "Candles in the dining hall float in mid-air during storms, casting eerie, shifting shadows."
	},
	{
		"category": "Mysterious Events",
		"description": "A door in the east wing is always locked, but no key has ever been found to open it."
	},
	{
		"category": "Ghosts and Entities",
		"description": "Isolde Blackwood wanders the halls in her ballgown, weeping and searching for something—or someone."
	},
	{
		"category": "Ghosts and Entities",
		"description": "Elara Blackwood appears near the fountain, her dress dripping wet, staring silently at visitors."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A faceless maid is seen polishing silverware that vanishes when she stops."
	},
	{
		"category": "Ghosts and Entities",
		"description": "Dr. Alistair Graves mutters equations and stares at invisible experiments in his old laboratory."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A shadow child giggles and hides in the walls, sometimes tugging on visitors’ sleeves."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A weeping woman in black is often seen in the library, crying over a book that burns when touched."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A tall, gaunt figure stands at the end of hallways, watching visitors with hollow eyes."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A laughing man in a top hat is heard cackling maniacally in the ballroom, but no one is there."
	},
	{
		"category": "Ghosts and Entities",
		"description": "The sound of a crying baby echoes through the nursery, but no child is ever found."
	},
	{
		"category": "Ghosts and Entities",
		"description": "A silent butler serves invisible guests in the dining hall, offering plates of rotten food."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "Isolde’s locket contains a portrait of a woman who is not Isolde, hinting at a hidden affair or betrayal."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "The Blackwood Journal is filled with Elias’s ramblings about 'the thing in the walls.'"
	},
	{
		"category": "Secrets and Artifacts",
		"description": "A bloodstained letter from Lilith warns Elias about 'the ritual,' but the rest is illegible."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "A silver key was found in the cellar, but no lock in the mansion fits it."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "A cursed mirror in the master bedroom shows reflections of people who aren’t there—sometimes screaming."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "A music box plays a haunting melody when wound, but its origin is unknown."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "An Ouija board in Dr. Graves’s lab is covered in frantic messages, some written in an unknown language."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "The Blackwood Family Bible has names crossed out in red ink, including Isolde’s."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "A collection of porcelain dolls in the nursery are each missing an eye, and their heads turn to follow visitors."
	},
	{
		"category": "Secrets and Artifacts",
		"description": "Strange symbols carved into the cellar walls glow faintly at night, pulsing like a heartbeat."
	},
	{
		"category": "Local Legends",
		"description": "Anyone who spends a night in the mansion will die within a year, according to local folklore."
	},
	{
		"category": "Local Legends",
		"description": "On the anniversary of Isolde’s disappearance, the mansion lights up, and ghostly figures dance inside."
	},
	{
		"category": "Local Legends",
		"description": "A statue in the garden weeps blood every full moon, staining the grass below."
	},
	{
		"category": "Local Legends",
		"description": "A bridge on the mansion’s grounds disappears at dawn, stranding those who cross it."
	},
	{
		"category": "Local Legends",
		"description": "A black carriage arrives at the mansion at midnight, but no one is ever inside."
	},
	{
		"category": "Local Legends",
		"description": "The mansion’s grandfather clock chimes 13 times on the hour, every hour."
	},
	{
		"category": "Local Legends",
		"description": "A room in the attic is said to contain a portal to another world, but the door is always locked."
	},
	{
		"category": "Local Legends",
		"description": "The stone lions at the entrance come to life at night, guarding the mansion from intruders."
	},
	{
		"category": "Local Legends",
		"description": "A traveler who stayed in the mansion in 1923 was found the next morning, aged 50 years."
	},
	{
		"category": "Local Legends",
		"description": "Ghostly figures are seen dining in the ballroom, but the food on their plates is always rotten."
	}
]
